#+title: Séance 1: Données et opérations de base

#+property: header-args :results output

** Clauses conditionnelles

Une clause conditionnelle est une partie du code qui n'est exécutée que si une condition est vérifiée. Voici un exemple:

#+begin_src python
import random

x = random.random()
a = 1

if x < 0.3:
    a += 1

elif x < 0.6:
    a += 2

else:
    a += 3

print(a)
#+end_src

#+RESULTS:
#+begin_example
4
#+end_example

*Important:* En python, l'intérieur d'une clause est marqué par un alinéa. EN général, cela replace les accolades ~{ }~ de C++. Normalement l'éditeur va mettre automatiquement les bons espaces au début. Le code _ne fonctionne pas_ si les alinéas ne sont pas bons.

Dans des clauses imbriquées, on empile les alinéas.

#+begin_src python :prologue import random
x = random.random()
a = 0

if x < 0.5:
    x += 0.2
    a += 1
    if x < 0.5:
        a += 1
    else:
        a += 2
else:
    a += 4

print(a)
#+end_src

